Duet3D/Duet3Expansion/src/atmel/SAMD11_DFP/1.1.70/atdf/ATSAMD11D14AM.atdf
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="STATUS" offset="0x7" rw="R" size="1" initval="0x00" caption="Status">
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
        </register>
        <register name="CLEAR" offset="0x8" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="WDT_CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="WDT_CONFIG__PER">
        <value name="8" caption="8 clock cycles" value="0x0"/>
        <value name="16" caption="16 clock cycles" value="0x1"/>
        <value name="32" caption="32 clock cycles" value="0x2"/>
        <value name="64" caption="64 clock cycles" value="0x3"/>
        <value name="128" caption="128 clock cycles" value="0x4"/>
        <value name="256" caption="256 clock cycles" value="0x5"/>
        <value name="512" caption="512 clock cycles" value="0x6"/>
        <value name="1K" caption="1024 clock cycles" value="0x7"/>
        <value name="2K" caption="2048 clock cycles" value="0x8"/>
        <value name="4K" caption="4096 clock cycles" value="0x9"/>
        <value name="8K" caption="8192 clock cycles" value="0xA"/>
        <value name="16K" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CONFIG__WINDOW">
        <value name="8" caption="8 clock cycles" value="0x0"/>
        <value name="16" caption="16 clock cycles" value="0x1"/>
        <value name="32" caption="32 clock cycles" value="0x2"/>
        <value name="64" caption="64 clock cycles" value="0x3"/>
        <value name="128" caption="128 clock cycles" value="0x4"/>
        <value name="256" caption="256 clock cycles" value="0x5"/>
        <value name="512" caption="512 clock cycles" value="0x6"/>
        <value name="1K" caption="1024 clock cycles" value="0x7"/>
        <value name="2K" caption="2048 clock cycles" value="0x8"/>
        <value name="4K" caption="4096 clock cycles" value="0x9"/>
        <value name="8K" caption="8192 clock cycles" value="0xA"/>
        <value name="16K" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_EWCTRL__EWOFFSET">
        <value name="8" caption="8 clock cycles" value="0x0"/>
        <value name="16" caption="16 clock cycles" value="0x1"/>
        <value name="32" caption="32 clock cycles" value="0x2"/>
        <value name="64" caption="64 clock cycles" value="0x3"/>
        <value name="128" caption="128 clock cycles" value="0x4"/>
        <value name="256" caption="256 clock cycles" value="0x5"/>
        <value name="512" caption="512 clock cycles" value="0x6"/>
        <value name="1K" caption="1024 clock cycles" value="0x7"/>
        <value name="2K" caption="2048 clock cycles" value="0x8"/>
        <value name="4K" caption="4096 clock cycles" value="0x9"/>
        <value name="8K" caption="8192 clock cycles" value="0xA"/>
        <value name="16K" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="WDT_CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
  <module name="SystemControl" caption="System Control Registers">
      <register-group name="SystemControl" caption="System Control Registers">
        <register offset="0x00000d00" size="4" name="CPUID" initval="0x410CC601" caption="CPUID Base Register">
          <bitfield mask="0x0000000f" name="REVISION" caption="Indicates patch release: 0x0 = Patch 0"/>
          <bitfield mask="0x0000fff0" name="PARTNO" caption="Indicates part number"/>
          <bitfield mask="0x000f0000" name="ARCHITECTURE" caption="Constant that defines the architecture of the processor"/>
          <bitfield mask="0x00f00000" name="VARIANT" caption="Indicates processor revision: 0x2 = Revision 2"/>
          <bitfield mask="0xff000000" name="IMPLEMENTER" caption="Implementer code"/>
        </register>
        <register offset="0x00000d04" size="4" name="ICSR" initval="0" caption="Interrupt Control and State Register">
          <bitfield mask="0x0003f000" name="VECTPENDING" caption="Exception number of the highest priority pending enabled exception"/>
          <bitfield mask="0x02000000" name="PENDSTCLR" values="PENDSTCLR" caption="no description available"/>
          <bitfield mask="0x04000000" name="PENDSTSET" values="PENDSTSET" caption="no description available"/>
          <bitfield mask="0x08000000" name="PENDSVCLR" values="PENDSVCLR" caption="no description available"/>
          <bitfield mask="0x10000000" name="PENDSVSET" values="PENDSVSET" caption="no description available"/>
          <bitfield mask="0x80000000" name="NMIPENDSET" values="NMIPENDSET" caption="no description available"/>
        </register>
        <register offset="0x00000d08" size="4" name="VTOR" initval="0" caption="Vector Table Offset Register">
          <bitfield mask="0xffffff80" name="TBLOFF" caption="Vector table base offset"/>
        </register>
        <register offset="0x00000d0c" size="4" name="AIRCR" initval="0xFA050000" caption="Application Interrupt and Reset Control Register">
          <bitfield mask="0x00000002" name="VECTCLRACTIVE" caption="no description available"/>
          <bitfield mask="0x00000004" name="SYSRESETREQ" values="SYSRESETREQ" caption="no description available"/>
          <bitfield mask="0x00008000" name="ENDIANNESS" values="ENDIANNESS" caption="no description available"/>
          <bitfield mask="0xffff0000" name="VECTKEY" caption="Register key"/>
        </register>
